---
kind: enumMember
id: F:Autodesk.Revit.DB.ConnectorType.Physical
enum: Autodesk.Revit.DB.ConnectorType
source: html/769d8156-55b0-bda8-9e8f-f81fce49f1af.htm
---
# Autodesk.Revit.DB.ConnectorType.Physical

Physical connection type